tutorials/multiphase/settlingFoam/dahl/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner   DIC;
        tolerance        1e-07;
        relTol           0;
    };
    U BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    };
    k BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    };
    epsilon BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    };
    rho PCG
    {
        preconditioner   DIC;
        tolerance        1e-07;
        relTol           0;
    };
    Alpha BiCGStab
    {
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    };
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
